/*
* Напишите функцию truncate, которая принимает строку и максимальную длину.

* Если длина строки превышает указанное количество символов, функция должна обрезать строку до этой длины и добавлять в конец многоточие (...).
* В противном случае функция должна возвращать исходную строку.

* Пример работы функции:
* truncate("Вот, что мне действительно нравится в этом", 20) // Ожидаемый результат: "Вот, что мне действи..."
* truncate("Короткая строка", 20) // Ожидаемый результат: "Короткая строка"
*/

function truncate(str, maxLength) {
    let result;
    for (let i = 0; i < str.length; i++) {
        if (str.length > maxLength) {
            result = str.slice(0, maxLength) + "..."
        } else if (str.length === 0 || str.length < maxLength) {
            result = str
        }
    }
    return result
}

console.log(truncate(" ", 20)); //// Ожидаемый результат: "Вот, что мне действи..."
console.log(truncate("Короткая строка", 20)); // Ожидаемый результат: "Короткая строка"
